---
kind: property
id: P:Autodesk.Revit.DB.BuiltInFailures.EditingFailures.CannotDeletePredefinedFamilyElement
source: html/682fe726-6369-0c40-028a-c7c115aa70f3.htm
---
# Autodesk.Revit.DB.BuiltInFailures.EditingFailures.CannotDeletePredefinedFamilyElement Property

Element is a built-in part of the family definition and cannot be deleted or added to groups.

## Syntax (C#)
```csharp
public static FailureDefinitionId CannotDeletePredefinedFamilyElement { get; }
```